Статистика работы механизмов/Конфигурация/DataProcessors/_ВыгрузкаЗадолженностейДляБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ВыгрузкаЗадолженностейДляБухгалтерии</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>d7p1:TextDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ВыгрузкаЗадолженностейДляБухгалтерии/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Выгрузка задолженностей для Бухгалтерии",
		"0.09",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура СфомрироватьСообщение(МассивЗадолженностей) Экспорт
	
	ПараметрыСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация, СчетДоверительногоУправления, Период, Контрагент, КаталогВыгрузки"); 
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СфомрироватьСообщение()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
	
	Запрос = Новый Запрос;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
#Область ТекстЗапроса		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеЗадолженностиОснования.Ссылка КАК УникальныйИдентификатор,
		|	НачислениеЗадолженностиОснования.Ссылка.Дата КАК Дата,
		|	НачислениеЗадолженностиОснования.Ссылка.Номер КАК Номер,
		|	НачислениеЗадолженностиОснования.Ссылка.Организация.ЮрФизЛицо КАК Организация,
		|	НачислениеЗадолженностиОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
		|	НачислениеЗадолженностиОснования.Ссылка.Контрагент КАК Контрагент,
		|	НачислениеЗадолженностиОснования.Ссылка.Договор КАК Договор,
		|	СУММА(НачислениеЗадолженностиОснования.Сумма) КАК Сумма,
		|	НачислениеЗадолженностиОснования.Ссылка.Валюта.Код КАК Валюта
		|ПОМЕСТИТЬ ВТ_НачисленияЗадолженностей
		|ИЗ
		|	Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
		|ГДЕ
		|	НачислениеЗадолженностиОснования.Ссылка В(&МассивЗадолженностей)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗадолженностиОснования.Ссылка,
		|	НачислениеЗадолженностиОснования.Ссылка.Дата,
		|	НачислениеЗадолженностиОснования.Ссылка.Номер,
		|	НачислениеЗадолженностиОснования.Ссылка.СчетДоверительногоУправления,
		|	НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности,
		|	НачислениеЗадолженностиОснования.Ссылка.Контрагент,
		|	НачислениеЗадолженностиОснования.Ссылка.Договор,
		|	НачислениеЗадолженностиОснования.Ссылка.Валюта.Код,
		|	НачислениеЗадолженностиОснования.Ссылка.Организация.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.ДатаЗадолженности КАК ДатаЗадолженности,
		|	КлиентыДоверительногоУправления.Клиент КАК Клиент
		|ПОМЕСТИТЬ ВТ_КлиентыДоверительногоУправления
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_НачисленияЗадолженностей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ВТ_НачисленияЗадолженностей.Дата КАК ДатаЗадолженности,
		|		МАКСИМУМ(КлиентыДоверительногоУправления.Период) КАК ДатаКлиента
		|	ИЗ
		|		ВТ_НачисленияЗадолженностей КАК ВТ_НачисленияЗадолженностей
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|			ПО ВТ_НачисленияЗадолженностей.СчетДоверительногоУправления = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|				И ВТ_НачисленияЗадолженностей.Дата >= КлиентыДоверительногоУправления.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_НачисленияЗадолженностей.СчетДоверительногоУправления,
		|		ВТ_НачисленияЗадолженностей.Дата) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.ДатаКлиента = КлиентыДоверительногоУправления.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_НачисленияЗадолженностей.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	ВТ_НачисленияЗадолженностей.Дата КАК Дата,
		|	ВТ_НачисленияЗадолженностей.Номер КАК Номер,
		|	ВТ_НачисленияЗадолженностей.Организация КАК Организация,
		|	ВТ_КлиентыДоверительногоУправления.Клиент КАК Клиент,
		|	ВТ_НачисленияЗадолженностей.СчетДоверительногоУправления КАК ДоговорСКлиентом,
		|	ВТ_НачисленияЗадолженностей.ВидЗадолженности КАК ВидЗадолженности,
		|	ВТ_НачисленияЗадолженностей.Контрагент КАК Контрагент,
		|	ВТ_НачисленияЗадолженностей.Договор КАК Договор,
		|	ВТ_НачисленияЗадолженностей.Сумма КАК Сумма,
		|	ВТ_НачисленияЗадолженностей.Валюта КАК Валюта
		|ПОМЕСТИТЬ Документы
		|ИЗ
		|	ВТ_НачисленияЗадолженностей КАК ВТ_НачисленияЗадолженностей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КлиентыДоверительногоУправления КАК ВТ_КлиентыДоверительногоУправления
		|		ПО ВТ_НачисленияЗадолженностей.СчетДоверительногоУправления = ВТ_КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|			И ВТ_НачисленияЗадолженностей.Дата = ВТ_КлиентыДоверительногоУправления.ДатаЗадолженности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	ВложенныйЗапрос.Наименование КАК Наименование,
		|	ВложенныйЗапрос.ПолноеНаименование КАК ПолноеНаименование,
		|	ВложенныйЗапрос.Вид КАК Вид,
		|	ВложенныйЗапрос.ИНН КАК ИНН,
		|	ВложенныйЗапрос.КПП КАК КПП,
		|	ВложенныйЗапрос.ОГРН КАК ОГРН,
		|	ВложенныйЗапрос.ДатаРеквизитов КАК ДатаРеквизитов,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК IDMX
		|ПОМЕСТИТЬ ЮрФизЛица
		|ИЗ
		|	(ВЫБРАТЬ
		|		Документы.Клиент КАК УникальныйИдентификатор,
		|		РеквизитыЮрФизЛицАнкетные.Наименование КАК Наименование,
		|		РеквизитыЮрФизЛицАнкетные.ПолноеНаименование КАК ПолноеНаименование,
		|		РеквизитыЮрФизЛицАнкетные.Вид КАК Вид,
		|		РеквизитыЮрФизЛицАнкетные.ИНН КАК ИНН,
		|		РеквизитыЮрФизЛицАнкетные.КПП КАК КПП,
		|		РеквизитыЮрФизЛицАнкетные.ОГРН КАК ОГРН,
		|		СвязьРеквизитов.ДатаРеквизитов КАК ДатаРеквизитов
		|	ИЗ
		|		Документы КАК Документы
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				Документы.Клиент КАК Клиент,
		|				Документы.Дата КАК ДатаЗадолженности,
		|				МАКСИМУМ(ЕСТЬNULL(РеквизитыФизическихЛицАнкетные.Период, РеквизитыЮридическихЛицАнкетные.Период)) КАК ДатаРеквизитов
		|			ИЗ
		|				Документы КАК Документы
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные КАК РеквизитыФизическихЛицАнкетные
		|					ПО Документы.Клиент = РеквизитыФизическихЛицАнкетные.ЮрФизЛицо
		|						И (РеквизитыФизическихЛицАнкетные.Организация = &Организация)
		|						И (РеквизитыФизическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|					ПО Документы.Клиент = РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо
		|						И (РеквизитыЮридическихЛицАнкетные.Организация = &Организация)
		|						И (РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			
		|			СГРУППИРОВАТЬ ПО
		|				Документы.Клиент,
		|				Документы.Дата) КАК СвязьРеквизитов
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					РеквизитыФизическихЛицАнкетные.Период КАК Период,
		|					РеквизитыФизическихЛицАнкетные.ЮрФизЛицо КАК ЮрФизЛицо,
		|					РеквизитыФизическихЛицАнкетные.Фамилия + РеквизитыФизическихЛицАнкетные.Имя + РеквизитыФизическихЛицАнкетные.Отчество КАК Наименование,
		|					РеквизитыФизическихЛицАнкетные.Фамилия + РеквизитыФизическихЛицАнкетные.Имя + РеквизитыФизическихЛицАнкетные.Отчество КАК ПолноеНаименование,
		|					""ФизЛицо"" КАК Вид,
		|					РеквизитыФизическихЛицАнкетные.ИНН КАК ИНН,
		|					"""" КАК КПП,
		|					"""" КАК ОГРН
		|				ИЗ
		|					РегистрСведений.РеквизитыФизическихЛицАнкетные КАК РеквизитыФизическихЛицАнкетные
		|				ГДЕ
		|					РеквизитыФизическихЛицАнкетные.Организация = &Организация
		|					И РеквизитыФизическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				
		|				ОБЪЕДИНИТЬ ВСЕ
		|				
		|				ВЫБРАТЬ
		|					РеквизитыЮридическихЛицАнкетные.Период,
		|					РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо,
		|					РеквизитыЮридическихЛицАнкетные.КраткоеНаименованиеПоУставу,
		|					РеквизитыЮридическихЛицАнкетные.ПолноеНаименованиеПоУставу,
		|					""ЮрЛицо"",
		|					РеквизитыЮридическихЛицАнкетные.ИНН,
		|					РеквизитыЮридическихЛицАнкетные.КПП,
		|					РеквизитыЮридическихЛицАнкетные.ОГРН
		|				ИЗ
		|					РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|				ГДЕ
		|					РеквизитыЮридическихЛицАнкетные.Организация = &Организация
		|					И РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮрФизЛицАнкетные
		|				ПО СвязьРеквизитов.Клиент = РеквизитыЮрФизЛицАнкетные.ЮрФизЛицо
		|					И СвязьРеквизитов.ДатаРеквизитов = РеквизитыЮрФизЛицАнкетные.Период
		|			ПО Документы.Клиент = СвязьРеквизитов.Клиент
		|				И Документы.Дата = СвязьРеквизитов.ДатаЗадолженности
		|	ГДЕ
		|		Документы.Клиент ССЫЛКА Справочник.ЮрФизЛица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Документы.Контрагент,
		|		РеквизитыЮрФизЛиц.Наименование,
		|		РеквизитыЮрФизЛиц.ПолноеНаименование,
		|		РеквизитыЮрФизЛиц.Вид,
		|		РеквизитыЮрФизЛиц.ИНН,
		|		РеквизитыЮрФизЛиц.КПП,
		|		РеквизитыЮрФизЛиц.ОГРН,
		|		СвязьРеквизитов.ДатаРеквизитов
		|	ИЗ
		|		Документы КАК Документы
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				Документы.Контрагент КАК Контрагент,
		|				Документы.Дата КАК ДатаЗадолженности,
		|				МАКСИМУМ(РеквизитыЮридическихЛиц.Период) КАК ДатаРеквизитов
		|			ИЗ
		|				Документы КАК Документы
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|					ПО Документы.Контрагент = РеквизитыЮридическихЛиц.ЮрФизЛицо
		|						И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|						И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			
		|			СГРУППИРОВАТЬ ПО
		|				Документы.Контрагент,
		|				Документы.Дата) КАК СвязьРеквизитов
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					РеквизитыЮридическихЛиц.Период КАК Период,
		|					РеквизитыЮридическихЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
		|					РеквизитыЮридическихЛиц.КраткоеНаименованиеПоУставу КАК Наименование,
		|					РеквизитыЮридическихЛиц.ПолноеНаименованиеПоУставу КАК ПолноеНаименование,
		|					""ЮрЛицо"" КАК Вид,
		|					РеквизитыЮридическихЛиц.ИНН КАК ИНН,
		|					РеквизитыЮридическихЛиц.КПП КАК КПП,
		|					ДокументыЮридическихЛиц.Номер КАК ОГРН
		|				ИЗ
		|					РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|							РеквизитыЮридическихЛиц.Период КАК Период,
		|							РеквизитыЮридическихЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
		|							МАКСИМУМ(ДокументыЮридическихЛиц.Период) КАК ПериодДокументов
		|						ИЗ
		|							РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц КАК ДокументыЮридическихЛиц
		|								ПО РеквизитыЮридическихЛиц.Период <= ДокументыЮридическихЛиц.Период
		|									И РеквизитыЮридическихЛиц.Подразделение = ДокументыЮридическихЛиц.Подразделение
		|									И РеквизитыЮридическихЛиц.Язык = ДокументыЮридическихЛиц.Язык
		|									И РеквизитыЮридическихЛиц.ЮрФизЛицо = ДокументыЮридическихЛиц.ЮрФизЛицо
		|									И (ДокументыЮридическихЛиц.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации))
		|									И (ДокументыЮридическихЛиц.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|										ИЛИ ДокументыЮридическихЛиц.ДействуетПо > РеквизитыЮридическихЛиц.Период)
		|						ГДЕ
		|							РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|							И РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|						
		|						СГРУППИРОВАТЬ ПО
		|							РеквизитыЮридическихЛиц.Период,
		|							РеквизитыЮридическихЛиц.ЮрФизЛицо) КАК ДатыДляДокументов
		|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц КАК ДокументыЮридическихЛиц
		|							ПО ДатыДляДокументов.ПериодДокументов = ДокументыЮридическихЛиц.Период
		|								И ДатыДляДокументов.ЮрФизЛицо = ДокументыЮридическихЛиц.ЮрФизЛицо
		|								И (ДокументыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|								И (ДокументыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|								И (ДокументыЮридическихЛиц.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации))
		|						ПО РеквизитыЮридическихЛиц.Период = ДатыДляДокументов.Период
		|							И РеквизитыЮридическихЛиц.ЮрФизЛицо = ДатыДляДокументов.ЮрФизЛицо
		|				ГДЕ
		|					РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮрФизЛиц
		|				ПО СвязьРеквизитов.Контрагент = РеквизитыЮрФизЛиц.ЮрФизЛицо
		|					И СвязьРеквизитов.ДатаРеквизитов = РеквизитыЮрФизЛиц.Период
		|			ПО Документы.Контрагент = СвязьРеквизитов.Контрагент
		|				И Документы.Дата = СвязьРеквизитов.ДатаЗадолженности
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Документы.Организация,
		|		РеквизитыЮрФизЛиц.Наименование,
		|		РеквизитыЮрФизЛиц.ПолноеНаименование,
		|		РеквизитыЮрФизЛиц.Вид,
		|		РеквизитыЮрФизЛиц.ИНН,
		|		РеквизитыЮрФизЛиц.КПП,
		|		РеквизитыЮрФизЛиц.ОГРН,
		|		СвязьРеквизитов.ДатаРеквизитов
		|	ИЗ
		|		Документы КАК Документы
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				Документы.Организация КАК Организация,
		|				Документы.Дата КАК ДатаЗадолженности,
		|				МАКСИМУМ(РеквизитыЮридическихЛиц.Период) КАК ДатаРеквизитов
		|			ИЗ
		|				Документы КАК Документы
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|					ПО Документы.Организация = РеквизитыЮридическихЛиц.ЮрФизЛицо
		|						И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|						И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			
		|			СГРУППИРОВАТЬ ПО
		|				Документы.Организация,
		|				Документы.Дата) КАК СвязьРеквизитов
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					РеквизитыЮридическихЛиц.Период КАК Период,
		|					РеквизитыЮридическихЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
		|					РеквизитыЮридическихЛиц.КраткоеНаименованиеПоУставу КАК Наименование,
		|					РеквизитыЮридическихЛиц.ПолноеНаименованиеПоУставу КАК ПолноеНаименование,
		|					""ЮрЛицо"" КАК Вид,
		|					РеквизитыЮридическихЛиц.ИНН КАК ИНН,
		|					РеквизитыЮридическихЛиц.КПП КАК КПП,
		|					ДокументыЮридическихЛиц.Номер КАК ОГРН
		|				ИЗ
		|					РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|							РеквизитыЮридическихЛиц.Период КАК Период,
		|							РеквизитыЮридическихЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
		|							МАКСИМУМ(ДокументыЮридическихЛиц.Период) КАК ПериодДокументов
		|						ИЗ
		|							РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц КАК ДокументыЮридическихЛиц
		|								ПО РеквизитыЮридическихЛиц.Период <= ДокументыЮридическихЛиц.Период
		|									И РеквизитыЮридическихЛиц.Подразделение = ДокументыЮридическихЛиц.Подразделение
		|									И РеквизитыЮридическихЛиц.Язык = ДокументыЮридическихЛиц.Язык
		|									И РеквизитыЮридическихЛиц.ЮрФизЛицо = ДокументыЮридическихЛиц.ЮрФизЛицо
		|									И (ДокументыЮридическихЛиц.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации))
		|									И (ДокументыЮридическихЛиц.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|										ИЛИ ДокументыЮридическихЛиц.ДействуетПо > РеквизитыЮридическихЛиц.Период)
		|						ГДЕ
		|							РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|							И РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|						
		|						СГРУППИРОВАТЬ ПО
		|							РеквизитыЮридическихЛиц.Период,
		|							РеквизитыЮридическихЛиц.ЮрФизЛицо) КАК ДатыДляДокументов
		|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц КАК ДокументыЮридическихЛиц
		|							ПО ДатыДляДокументов.ПериодДокументов = ДокументыЮридическихЛиц.Период
		|								И ДатыДляДокументов.ЮрФизЛицо = ДокументыЮридическихЛиц.ЮрФизЛицо
		|								И (ДокументыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|								И (ДокументыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|								И (ДокументыЮридическихЛиц.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации))
		|						ПО РеквизитыЮридическихЛиц.Период = ДатыДляДокументов.Период
		|							И РеквизитыЮридическихЛиц.ЮрФизЛицо = ДатыДляДокументов.ЮрФизЛицо
		|				ГДЕ
		|					РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮрФизЛиц
		|				ПО СвязьРеквизитов.Организация = РеквизитыЮрФизЛиц.ЮрФизЛицо
		|					И СвязьРеквизитов.ДатаРеквизитов = РеквизитыЮрФизЛиц.Период
		|			ПО Документы.Организация = СвязьРеквизитов.Организация
		|				И Документы.Дата = СвязьРеквизитов.ДатаЗадолженности
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Документы.Клиент,
		|		РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда,
		|		ПОДСТРОКА(РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда, 1, 150),
		|		""ПИФ"",
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL
		|	ИЗ
		|		Документы КАК Документы
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|			ПО Документы.Клиент = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|	ГДЕ
		|		Документы.Клиент ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО ВложенныйЗапрос.УникальныйИдентификатор = КодыВоВнешнихСистемахСрезПоследних.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Документы.ДоговорСКлиентом.Ссылка КАК УникальныйИдентификатор,
		|	Документы.Клиент КАК ЮрЛицо,
		|	""Договор доверительного управления"" КАК ВидДоговора,
		|	ВЫБОР
		|		КОГДА Документы.Клиент ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды
		|			ТОГДА Документы.Клиент.НомерПравил
		|		ИНАЧЕ Документы.ДоговорСКлиентом.НомерДоговора
		|	КОНЕЦ КАК НомерДоговора,
		|	Документы.ДоговорСКлиентом.ДатаЗаключения КАК ДатаДоговора
		|ПОМЕСТИТЬ Договоры
		|ИЗ
		|	Документы КАК Документы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Документы.Договор,
		|	Документы.Контрагент,
		|	ВЫБОР
		|		КОГДА Документы.Договор ССЫЛКА Справочник.Договоры
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(Документы.Договор.ВидДоговора)
		|	КОНЕЦ,
		|	Документы.Договор.НомерДоговора,
		|	Документы.Договор.ДатаЗаключения
		|ИЗ
		|	Документы КАК Документы
		|ГДЕ
		|	Документы.Договор <> ЗНАЧЕНИЕ(Справочник.Договоры.)
		|	И Документы.Договор <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Документы.ВидЗадолженности.Ссылка КАК УникальныйИдентификатор,
		|	Документы.ВидЗадолженности.Наименование КАК Наименование
		|ПОМЕСТИТЬ ВидыЗадолженности
		|ИЗ
		|	Документы КАК Документы";
#КонецОбласти			

	Запрос.УстановитьПараметр("МассивЗадолженностей", МассивЗадолженностей);
	Запрос.УстановитьПараметр("Организация"			, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("КонецПериода"		, ЭтотОбъект.Период.ДатаОкончания);

	Запрос.Выполнить();

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xsd");
	ПолучитьМакет("Схема").Записать(ИмяВременногоФайла);
	
	МассивXSD = Новый Массив;
	МассивXSD.Добавить(ИмяВременногоФайла);
	
	НоваяФабрикаXDTO = СоздатьФабрикуXDTO(МассивXSD);

	Сообщение = НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип("EXCHANGE", "UFOtoBuh"));
	
	ИменаВыгружаемыхДанных = Новый Структура;
	ИменаВыгружаемыхДанных.Вставить("Документы"			, "Документ");
	ИменаВыгружаемыхДанных.Вставить("ЮрФизЛица"			, "ЮрФизЛицо");
	ИменаВыгружаемыхДанных.Вставить("Договоры"			, "Договор");
	ИменаВыгружаемыхДанных.Вставить("ВидыЗадолженности"	, "ВидЗадолженности");

	Для Каждого ИмяВыгружаемыхДанных Из ИменаВыгружаемыхДанных Цикл
		Данные = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВыгружаемыхДанных.Ключ).ПолучитьДанные().Выгрузить();	
		Для Каждого СтрокаДанных Из Данные Цикл
			СтрокаXDTO = НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип("EXCHANGE", ИмяВыгружаемыхДанных.Значение));
			Для Каждого Колонка Из Данные.Колонки Цикл
				Если ЗначениеЗаполнено(СтрокаДанных[Колонка.Имя]) Тогда
					СтрокаXDTO[Колонка.Имя] = СериализаторXDTO.XMLСтрока(СтрокаДанных[Колонка.Имя]);
				КонецЕсли;
			КонецЦикла;
			Сообщение[ИмяВыгружаемыхДанных.Ключ].Добавить(СтрокаXDTO);
		КонецЦикла;	
	КонецЦикла;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(КаталогВременныхФайлов() + "\UFOtoBuh" + ".xml", "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	НоваяФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Сообщение);
	ЗаписьXML.Закрыть();
	
	ТекстСообщения.Прочитать(КаталогВременныхФайлов() + "\UFOtoBuh" + ".xml");
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
